//this is kind of a poor example for plugins, since the format's not totally known and the code is WIP.
//but it does showcase some interesting usages.

#include "stdafx.h"
#undef max
#undef min
#include "half.hpp"
using half_float::half;
#include <map>
#include <stack>

const char *g_pPluginName = "bayonetta_pc";
const char *g_pPluginDesc = "Bayonetta PC model handler, by Dick, Kerilk.";

FILE *bayo_log;
#ifdef _DEBUG
#define DBGLOG(fmt, ...) fprintf(bayo_log, fmt, __VA_ARGS__)
#define OPENLOG() (bayo_log = fopen("bayo.log", "w"))
#define CLOSELOG() fclose(bayo_log)
#define DBGFLUSH() fflush(bayo_log)
#else
#define DBGLOG(fmt, ...) do { if (0) fprintf(bayo_log, fmt, __VA_ARGS__); } while (0)
#define OPENLOG() do { if (0) bayo_log = fopen("bayo.log", "w+"); } while (0)
#define CLOSELOG() do { if (0) fclose(bayo_log); } while (0)
#define DBGFLUSH() do { if (0) fflush(bayo_log); } while (0)
#endif

#define DBG_ANIM_DATA 0
#if DBG_ANIM_DATA
#define DBGALOG(fmt, ...) DBGLOG(fmt, __VA_ARGS__)
#else
#define DBGALOG(fmt, ...) do { if (0) DBGLOG(fmt, __VA_ARGS__); } while (0)
#endif

typedef enum game_e {
	BAYONETTA,
	BAYONETTA2,
	VANQUISH,
	NIER_AUTOMATA
} game_t;

typedef struct bayoDat_s
{
	BYTE			id[4];
	int				numRes;
	int				ofsRes;
	int				ofsType;
	int				ofsNames;
	int				ofsSizes;
} bayoDat_t;

template <bool big>
struct bayoDat : public bayoDat_s {
	bayoDat( bayoDat_t * ptr ): bayoDat_s(*ptr){
		if (big) {
			LITTLE_BIG_SWAP(numRes);
			LITTLE_BIG_SWAP(ofsRes);
			LITTLE_BIG_SWAP(ofsType);
			LITTLE_BIG_SWAP(ofsNames);
			LITTLE_BIG_SWAP(ofsSizes);
		}
	}
};
typedef struct bayoDatFile_s
{
	char				*name;
	BYTE				*data;
	int					dataSize;
} bayoDatFile_t;
typedef struct bayoWTBHdr_s
{
	BYTE				id[4];
	int					unknown;
	int					numTex;
	int					ofsTexOfs;
	int					ofsTexSizes;
	int					ofsTexFlags;
	int					texIdxOffset;
	int					texInfoOffset;
} bayoWTBHdr_t;
template <bool big>
struct bayoWTBHdr : public bayoWTBHdr_s {
	bayoWTBHdr( bayoWTBHdr_t *ptr ): bayoWTBHdr_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(*((int *)id));
			LITTLE_BIG_SWAP(unknown);
			LITTLE_BIG_SWAP(numTex);
			LITTLE_BIG_SWAP(ofsTexOfs);
			LITTLE_BIG_SWAP(ofsTexSizes);
			LITTLE_BIG_SWAP(ofsTexFlags);
			LITTLE_BIG_SWAP(texIdxOffset);
			LITTLE_BIG_SWAP(texInfoOffset);
		}
	}
};
typedef struct bayoWTAHdr_s
{
	BYTE				id[4];
	int					unknown;
	int					numTex;
	int					ofsTexOfs;
	int					ofsTexSizes;
	int					ofsTexFlags;
	int					texIdxOffset;
	int					texInfoOffset;
	int					ofsMipmapOfs;
} bayoWTAHdr_t;
template <bool big>
struct bayoWTAHdr : public bayoWTAHdr_s {
	bayoWTAHdr( bayoWTAHdr_t *ptr ): bayoWTAHdr_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(*((int *)id));
			LITTLE_BIG_SWAP(unknown);
			LITTLE_BIG_SWAP(numTex);
			LITTLE_BIG_SWAP(ofsTexOfs);
			LITTLE_BIG_SWAP(ofsTexSizes);
			LITTLE_BIG_SWAP(ofsTexFlags);
			LITTLE_BIG_SWAP(texIdxOffset);
			LITTLE_BIG_SWAP(texInfoOffset);
			LITTLE_BIG_SWAP(ofsMipmapOfs);
		}
	}
};
// Texture is now DDS
typedef struct ddsPixelFormat_s
{
	int					size;
	int					flags;
	int					id;
	int					rgbBitCount;
	int					rBitMask;
	int					gBitMask;
	int					bBitMask;
	int					aBitMask;
} ddsPixelFormat_t;
typedef struct ddsTexHdr_s
{
	BYTE				id[4];
	int					hSize;
	int					flags;
	int					height;
	int					width;
	int					pitchOrLinearSize;
	int					depth;
	int					mipMapCount;
	int					reserved1[11];
	ddsPixelFormat_t	pixelFormat;
	int					caps;
	int					caps2;
	int					caps3;
	int					caps4;
	int					reserved2;
} ddsTexHdr_t;
typedef struct wtbTexHdr_s
{
	int					unknownA;
	int					unknownB;
	int					unknownC;
	int					unknownD;
	int					unknownE;
	short				unknownF;
	short				unknownG;
	short				unknownH;
	short				unknownI;
	short				unknownJ;
	short				unknownK;
	int					texFmt;
	WORD				heightBits;
	WORD				widthBits;
	int					unknownO;
	int					unknownP;
	int					unknownQ;
} wtbTexHdr_t;
typedef struct GX2Hdr_s {
	DWORD dimension;
	DWORD width;
	DWORD height;
	DWORD depth;
	DWORD numMipmaps;
	DWORD format;
	DWORD AAMode;
	DWORD usage;
	DWORD dataLength;
	DWORD dataPointer;
	DWORD mipmapsDataLength;
	DWORD mimapsPointer;
	DWORD tileMode;
	DWORD swizzleValue;
	DWORD alignment;
	DWORD pitch;
	DWORD mimapOffsets[13];
	DWORD firstMipmap;
	DWORD numMipmaps2;
	DWORD firstSlice;
	DWORD numSlices;
	BYTE component[4];
	DWORD textureRegisters[5];
} GX2Hdr_t;
template <bool big>
struct GX2Hdr : public GX2Hdr_s {
	GX2Hdr( GX2Hdr_t *ptr ): GX2Hdr_s(*ptr) {
		LITTLE_BIG_SWAP(dimension);
		LITTLE_BIG_SWAP(width);
		LITTLE_BIG_SWAP(height);
		LITTLE_BIG_SWAP(depth);
		LITTLE_BIG_SWAP(numMipmaps);
		LITTLE_BIG_SWAP(format);
		LITTLE_BIG_SWAP(AAMode);
		LITTLE_BIG_SWAP(usage);
		LITTLE_BIG_SWAP(dataLength);
		LITTLE_BIG_SWAP(dataPointer);
		LITTLE_BIG_SWAP(mipmapsDataLength);
		LITTLE_BIG_SWAP(mimapsPointer);
		LITTLE_BIG_SWAP(tileMode);
		LITTLE_BIG_SWAP(swizzleValue);
		LITTLE_BIG_SWAP(alignment);
		LITTLE_BIG_SWAP(pitch);
		for (int i = 0; i < 13; i++) LITTLE_BIG_SWAP(mimapOffsets);
		LITTLE_BIG_SWAP(firstMipmap);
		LITTLE_BIG_SWAP(numMipmaps2);
		LITTLE_BIG_SWAP(firstSlice);
		LITTLE_BIG_SWAP(numSlices);
		for (int i = 0; i < 5; i++) LITTLE_BIG_SWAP(textureRegisters[i]);
	}
};
typedef struct bayoSCRHdr_s
{
	BYTE				id[4];
	int					numModels;
	unsigned int		ofsTextures;
	BYTE				unknown[4];
} bayoSCRHdr_t;
template <bool big>
struct bayoSCRHdr : public bayoSCRHdr_s {
	bayoSCRHdr(bayoSCRHdr_t * ptr) : bayoSCRHdr_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(numModels);
			LITTLE_BIG_SWAP(ofsTextures);
		}
	}
};
typedef struct bayo2SCRHdr_s
{
	BYTE				id[4];
	unsigned short		unknownA;
	unsigned short		numModels;
	unsigned int		ofsOffsetsModels;
} bayo2SCRHdr_t;
template <bool big>
struct bayo2SCRHdr : public bayo2SCRHdr_s {
	bayo2SCRHdr(bayo2SCRHdr_t * ptr) : bayo2SCRHdr_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(unknownA);
			LITTLE_BIG_SWAP(numModels);
			LITTLE_BIG_SWAP(ofsOffsetsModels);
		}
	}
};
typedef struct bayoSCRModelDscr_s
{
	BYTE				name[16];
	unsigned int		offset;
	float				transform[9];
	short				unknownA[42];
}bayoSCRModelDscr_t;
template <bool big>
struct bayoSCRModelDscr : public bayoSCRModelDscr_s {
	bayoSCRModelDscr(bayoSCRModelDscr_t * ptr) : bayoSCRModelDscr_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(offset);
			for (int i = 0; i < 9; i++) {
				LITTLE_BIG_SWAP(transform[i]);
			}
			for (int i = 0; i < 42; i++) {
				LITTLE_BIG_SWAP(unknownA[i]);
			}
		}
	}
};
typedef struct bayo2SCRModelDscr_s
{
	unsigned int		offset;
	BYTE				name[64];
	float				transform[9];
	short				unknownA[18]; //Speculations
}bayo2SCRModelDscr_t;
template <bool big>
struct bayo2SCRModelDscr : public bayo2SCRModelDscr_s {
	bayo2SCRModelDscr(bayo2SCRModelDscr_t * ptr) : bayo2SCRModelDscr_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(offset);
			for (int i = 0; i < 9; i++) {
				LITTLE_BIG_SWAP(transform[i]);
			}
			for (int i = 0; i < 18; i++) {
				LITTLE_BIG_SWAP(unknownA[i]);
			}
		}
	}
};
typedef struct bayoVector_s {
	float x;
	float y;
	float z;
	void swap(void) {
		LITTLE_BIG_SWAP(x);
		LITTLE_BIG_SWAP(y);
		LITTLE_BIG_SWAP(z);
	}
} bayoVector_t;
typedef struct nierWMBHdr_s
{
	BYTE				id[4];				// 0
	unsigned int		version;			// 4
	int					unknownA;			// 8
	short				unknownB;			// C Seems related to vertex index size
	short				unknownC;			// E
	float				boundingBox[6];		//10
	unsigned int		ofsBones;			//28
	int					numBones;			//2C
	unsigned int		ofsBoneIndexTT;		//30
	int					sizeBoneIndexTT;	//34
	unsigned int		ofsVertexGroups;	//38
	int					numVertexGroups;	//3C
	unsigned int		ofsBatches;			//40
	int					numBatches;			//44
	unsigned int		ofsLods;			//48
	int					numLods;			//4C
	unsigned int		ofsUnknownD;		//50
	int					numUnknownE;		//54
	unsigned int		ofsBoneMap;			//58
	int					sizeBoneMap;		//5C
	unsigned int		ofsBoneSets;		//60
	int					numBoneSets;		//64
	unsigned int		ofsMaterials;		//68
	int					numMaterials;		//6C
	unsigned int		ofsMeshes;			//70
	int					numMeshes;			//74
	unsigned int		ofsMeshMaterial;	//78
	int					numMeshMaterial;	//7C
	unsigned int		ofsUnknownF;		//80
	int					numUnknownG;		//84
} nierWMBHdr_t;
template <bool big>
struct nierWMBHdr : public nierWMBHdr_s {
	nierWMBHdr(nierWMBHdr_t * ptr) : nierWMBHdr_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(*((int *)id));
			LITTLE_BIG_SWAP(version);
			LITTLE_BIG_SWAP(unknownA);
			LITTLE_BIG_SWAP(unknownB);
			LITTLE_BIG_SWAP(unknownC);
			for (int i = 0; i < 6; i++) {
				LITTLE_BIG_SWAP(boundingBox[i]);
			}
			LITTLE_BIG_SWAP(ofsBones);
			LITTLE_BIG_SWAP(numBones);
			LITTLE_BIG_SWAP(ofsBoneIndexTT);
			LITTLE_BIG_SWAP(sizeBoneIndexTT);
			LITTLE_BIG_SWAP(ofsVertexGroups);
			LITTLE_BIG_SWAP(numVertexGroups);
			LITTLE_BIG_SWAP(ofsBatches);
			LITTLE_BIG_SWAP(numBatches);
			LITTLE_BIG_SWAP(ofsLods);
			LITTLE_BIG_SWAP(numLods);
			LITTLE_BIG_SWAP(ofsUnknownD);
			LITTLE_BIG_SWAP(numUnknownE);
			LITTLE_BIG_SWAP(ofsBoneMap);
			LITTLE_BIG_SWAP(sizeBoneMap);
			LITTLE_BIG_SWAP(ofsBoneSets);
			LITTLE_BIG_SWAP(numBoneSets);
			LITTLE_BIG_SWAP(ofsMaterials);
			LITTLE_BIG_SWAP(numMaterials);
			LITTLE_BIG_SWAP(ofsMeshes);
			LITTLE_BIG_SWAP(numMeshes);
			LITTLE_BIG_SWAP(ofsMeshMaterial);
			LITTLE_BIG_SWAP(numMeshMaterial);
			LITTLE_BIG_SWAP(ofsUnknownF);
			LITTLE_BIG_SWAP(numUnknownG);
		}
	}
};
typedef struct nierMaterial_s
{

	short			version[4];
	unsigned int	ofsName;
	unsigned int	ofsShaderName;
	unsigned int	ofsTechniqueName;
	unsigned int	unknownA;
	unsigned int	ofsTextures;
	unsigned int	numTextures;
	unsigned int	ofsParameterGroups;
	unsigned int	numParametersGroup;
	unsigned int	ofsVariables;
	unsigned int	numVariables;
} nierMaterial_t;
template <bool big>
struct nierMaterial : public nierMaterial_s {
	nierMaterial(nierMaterial_t * ptr) : nierMaterial_s(*ptr) {
		if (big) {
			for (int i = 0; i < 4; i++) {
				LITTLE_BIG_SWAP(version[i]);
			}
			LITTLE_BIG_SWAP(ofsName);
			LITTLE_BIG_SWAP(ofsShaderName);
			LITTLE_BIG_SWAP(ofsTechniqueName);
			LITTLE_BIG_SWAP(unknownA);
			LITTLE_BIG_SWAP(ofsTextures);
			LITTLE_BIG_SWAP(numTextures);
			LITTLE_BIG_SWAP(ofsParameterGroups);
			LITTLE_BIG_SWAP(numParametersGroup);
			LITTLE_BIG_SWAP(ofsVariables);
			LITTLE_BIG_SWAP(numVariables);
		}
	}
};
typedef struct nierTexture_s
{
	unsigned int	ofsName;
	int				id;
} nierTexture_t;
template <bool big>
struct nierTexture : public nierTexture_s {
	nierTexture(nierTexture_t * ptr) : nierTexture_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(ofsName);
			LITTLE_BIG_SWAP(id);
		}
	}
};
typedef struct nierBone_s
{
	short			id;
	short			parentIndex;
	bayoVector_t	localPosition;
	bayoVector_t	localRotation;
	bayoVector_t	localScale;
	bayoVector_t	position;
	bayoVector_t	rotation;
	bayoVector_t	scale;
	bayoVector_t	tPosition;
} nierBone_t;
template <bool big>
struct nierBone : public nierBone_s {
	nierBone(nierBone_t * ptr) : nierBone_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(id);
			LITTLE_BIG_SWAP(parentIndex);
			localPosition.swap();
			localRotation.swap();
			localScale.swap();
			position.swap();
			rotation.swap();
			scale.swap();
			tPosition.swap();
		}
	}
};
typedef struct nierVertexGroup_s {
	unsigned int	ofsVerts;
	unsigned int	ofsVertsExData;
	unsigned int	unknownA;
	unsigned int	unknownB;
	unsigned int	sizeVert;
	unsigned int	sizeVertExData;
	unsigned int	unknownD;
	unsigned int	unknownE;
	unsigned int	numVerts;
	unsigned int	vertExDataFlag;
	unsigned int	ofsIndexBuffer;
	unsigned int	numIndexes;
} nierVertexGroup_t;
template <bool big>
struct nierVertexGroup : public nierVertexGroup_s {
	nierVertexGroup(nierVertexGroup_t * ptr) : nierVertexGroup_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(ofsVerts);
			LITTLE_BIG_SWAP(ofsVertsExData);
			LITTLE_BIG_SWAP(unknownA);
			LITTLE_BIG_SWAP(unknownB);
			LITTLE_BIG_SWAP(sizeVert);
			LITTLE_BIG_SWAP(sizeVertExData);
			LITTLE_BIG_SWAP(unknownD);
			LITTLE_BIG_SWAP(unknownE);
			LITTLE_BIG_SWAP(numVerts);
			LITTLE_BIG_SWAP(vertExDataFlag);
			LITTLE_BIG_SWAP(ofsIndexBuffer);
			LITTLE_BIG_SWAP(numIndexes);
		}
	}
};
typedef struct nierMesh_s {
	unsigned int	ofsName;
	float			boundingBox[6];
	unsigned int	ofsMaterials;
	unsigned int	numMaterials;
	unsigned int	ofsBones;
	unsigned int	numBones;
} nierMesh_t;
template <bool big>
struct nierMesh : public nierMesh_s {
	nierMesh(nierMesh_t * ptr) : nierMesh_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(ofsName);
			for (int i = 0; i < 6; i++) {
				LITTLE_BIG_SWAP(boundingBox[i]);
			}
			LITTLE_BIG_SWAP(ofsMaterials);
			LITTLE_BIG_SWAP(numMaterials);
			LITTLE_BIG_SWAP(ofsBones);
			LITTLE_BIG_SWAP(numBones);
		}
	}
};
typedef struct nierLod_s
{
	unsigned int	ofsName;
	int				lodLevel;
	unsigned int	batchStart;
	unsigned int	ofsBatchInfos;
	unsigned int	numBatchInfos;
} nierLod_t;
template <bool big>
struct nierLod : public nierLod_s {
	nierLod(nierLod_t * ptr) : nierLod_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(ofsName);
			LITTLE_BIG_SWAP(lodLevel);
			LITTLE_BIG_SWAP(batchStart);
			LITTLE_BIG_SWAP(ofsBatchInfos);
			LITTLE_BIG_SWAP(numBatchInfos);
		}
	}
};
typedef struct nierBatchInfo_s
{
	unsigned int	vertexGroupIndex;
	unsigned int	meshIndex;
	unsigned int	materialIndex;
	int				unknownA;
	unsigned int	meshMaterialPairIndex;
	int				unknownB;
} nierBatchInfo_t;
template <bool big>
struct nierBatchInfo : nierBatchInfo_s {
	nierBatchInfo(nierBatchInfo_t * ptr) : nierBatchInfo_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(vertexGroupIndex);
			LITTLE_BIG_SWAP(meshIndex);
			LITTLE_BIG_SWAP(materialIndex);
			LITTLE_BIG_SWAP(unknownA);
			LITTLE_BIG_SWAP(meshMaterialPairIndex);
			LITTLE_BIG_SWAP(unknownB);
		}
	}
};
typedef struct nierBatch_s {
	unsigned int	vertexGroupIndex;
	int				boneSetIndex;
	unsigned int	vertexStart;
	unsigned int	indexStart;
	unsigned int	numVerts;
	unsigned int	numIndices;
	unsigned int	numPrimitives;
} nierBatch_t;
template <bool big>
struct nierBatch : public nierBatch_s {
	nierBatch(nierBatch_t * ptr) : nierBatch_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(vertexGroupIndex);
			LITTLE_BIG_SWAP(boneSetIndex);
			LITTLE_BIG_SWAP(vertexStart);
			LITTLE_BIG_SWAP(indexStart);
			LITTLE_BIG_SWAP(numVerts);
			LITTLE_BIG_SWAP(numIndices);
			LITTLE_BIG_SWAP(numPrimitives);
		}
	}
};
typedef struct nierBoneSet_s {
	unsigned int	ofsBoneSet;
	unsigned int	numBoneIndices;
} nierBoneSet_t;
template <bool big>
struct nierBoneSet : public nierBoneSet_s {
	nierBoneSet(nierBoneSet_t * ptr) : nierBoneSet_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(ofsBoneSet);
			LITTLE_BIG_SWAP(numBoneIndices);
		}
	}
};
typedef struct bayoWMBHdr_s
{
	BYTE				id[4];				// 0
	int					unknownA;			// 4
	int					unknownB;			// 8
	int					numVerts;			// C
	BYTE				unknownC;			//10
	BYTE				unknownD;			//11
	WORD				unknownE;			//12
	int					ofsPositions;		//14
	int					ofsVerts;			//18
	int					ofsVertExData;		//1C
	int					unknownG[4];		//20
	int					numBones;			//30
	int					ofsBoneHie;			//34
	int					ofsBoneDataA;		//38
	int					ofsBoneDataB;		//3C
	int					ofsBoneHieB;		//40
	int					numMaterials;		//44
	int					ofsMaterialsOfs;	//48
	int					ofsMaterials;		//4C
	int					numMeshes;			//50
	int					ofsMeshOfs;			//54
	int					ofsMeshes;			//58
	int					unknownK;			//5C
	int					unknownL;			//60
	int					ofsUnknownJ;		//64
	int					ofsUnknownK;		//68
	int					ofsUnknownL;		//6C
	int					exMatInfo[4];		//70
} bayoWMBHdr_t;
template <bool big>
struct bayoWMBHdr : public bayoWMBHdr_s {
	bayoWMBHdr( bayoWMBHdr_t * ptr ): bayoWMBHdr_s(*ptr){
		if (big) {
			LITTLE_BIG_SWAP(*((int *)id));
			LITTLE_BIG_SWAP(unknownA);
			LITTLE_BIG_SWAP(unknownB);
			LITTLE_BIG_SWAP(numVerts);
			LITTLE_BIG_SWAP(unknownE);
			LITTLE_BIG_SWAP(ofsPositions);
			LITTLE_BIG_SWAP(ofsVerts);
			LITTLE_BIG_SWAP(ofsVertExData);
			for(int i=0; i<4; i++) LITTLE_BIG_SWAP(unknownG[i]);
			LITTLE_BIG_SWAP(numBones);
			LITTLE_BIG_SWAP(ofsBoneHie);
			LITTLE_BIG_SWAP(ofsBoneDataA);
			LITTLE_BIG_SWAP(ofsBoneDataB);
			LITTLE_BIG_SWAP(ofsBoneHieB);
			LITTLE_BIG_SWAP(numMaterials);
			LITTLE_BIG_SWAP(ofsMaterialsOfs);
			LITTLE_BIG_SWAP(ofsMaterials);
			LITTLE_BIG_SWAP(numMeshes);
			LITTLE_BIG_SWAP(ofsMeshOfs);
			LITTLE_BIG_SWAP(ofsMeshes);
			LITTLE_BIG_SWAP(unknownK);
			LITTLE_BIG_SWAP(unknownL);
			LITTLE_BIG_SWAP(ofsUnknownJ);
			LITTLE_BIG_SWAP(ofsUnknownK);
			LITTLE_BIG_SWAP(ofsUnknownL);
			for(int i=0; i<4; i++) LITTLE_BIG_SWAP(exMatInfo[i]);
		}
	}
};
typedef struct wmbMesh_s
{
	WORD				id;
	WORD				numBatch;
	int					unknownB;
	int					batchOfs;
	int					unknownD;
	int					unknownE[4];
	char				name[32];
	float				mat[12];
} wmbMesh_t;
template <bool big>
struct wmbMesh : public wmbMesh_s {
	wmbMesh( wmbMesh_t * ptr ): wmbMesh_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(id);
			LITTLE_BIG_SWAP(numBatch);
			LITTLE_BIG_SWAP(unknownB);
			LITTLE_BIG_SWAP(batchOfs);
			LITTLE_BIG_SWAP(unknownD);
			for(int i=0; i<4; i++) LITTLE_BIG_SWAP(unknownE[i]);
			for(int i=0; i<12; i++) LITTLE_BIG_SWAP(mat[i]);
		}
	}
};
typedef struct wmbBatch_s
{
	WORD				unknownA;
	WORD				id;
	WORD				unknownB;
	WORD				unknownC;
	BYTE				texID;
	BYTE				unknownDB;
	BYTE				unknownE1;
	BYTE				unknownE2;
	int					vertStart;
	int					vertEnd;
	int					primType;
	int					ofsIndices;
	int					numIndices;
	int					vertOfs;
	int					unknownI[7];
} wmbBatch_t;
template <bool big>
struct wmbBatch : public wmbBatch_s {
	wmbBatch( wmbBatch_t * ptr ): wmbBatch_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(unknownA);
			LITTLE_BIG_SWAP(id);
			LITTLE_BIG_SWAP(unknownB);
			LITTLE_BIG_SWAP(unknownC);
			LITTLE_BIG_SWAP(texID);
			LITTLE_BIG_SWAP(unknownDB);
			LITTLE_BIG_SWAP(unknownE1);
			LITTLE_BIG_SWAP(unknownE2);
			LITTLE_BIG_SWAP(vertStart);
			LITTLE_BIG_SWAP(vertEnd);
			LITTLE_BIG_SWAP(primType);
			LITTLE_BIG_SWAP(ofsIndices);
			LITTLE_BIG_SWAP(numIndices);
			LITTLE_BIG_SWAP(vertOfs);
			for(int i=0; i<7; i++) LITTLE_BIG_SWAP(unknownI[i]);
		}
	}
};
typedef struct bayoTex_s
{
	BYTE				tex_idx;
	BYTE				tex_flagA;
	WORD				tex_flagB;
} bayoTex_t;
typedef struct wmbMat_s
{
	WORD				matFlags;
	WORD				unknownB;
	bayoTex_t			texs[5];
} wmbMat_t;
template <bool big>
struct wmbMat : public wmbMat_s {
	wmbMat( wmbMat_t *ptr ): wmbMat_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(matFlags);
			LITTLE_BIG_SWAP(unknownB);
			for( int i = 0; i < 5; i++ ) {
				LITTLE_BIG_SWAP(texs[i]);
			}
		}
	}
};
typedef struct bayo2EXPHdr_s
{
	BYTE				id[4];
	int					version;
	unsigned int		offsetRecords;
	int					numRecords;
	unsigned int		offsetInterpolationData;
	int					numtInterpolationData;
} bayo2EXPHdr_t;
template <bool big>
struct bayo2EXPHdr : public bayo2EXPHdr_s
{
	bayo2EXPHdr(bayo2EXPHdr_t *ptr) : bayo2EXPHdr_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(version);
			LITTLE_BIG_SWAP(offsetRecords);
			LITTLE_BIG_SWAP(numRecords);
			LITTLE_BIG_SWAP(offsetInterpolationData);
			LITTLE_BIG_SWAP(numtInterpolationData);
		}
	}
};
typedef struct bayoEXPHdr_s
{
	BYTE				id[4];
	int					unknownA;
	unsigned int		offsetRecords;
	unsigned int		numRecords;
} bayoEXPHdr_t;
template <bool big>
struct bayoEXPHdr : public bayoEXPHdr_s
{
	bayoEXPHdr(bayoEXPHdr_t *ptr) : bayoEXPHdr_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(unknownA);
			LITTLE_BIG_SWAP(offsetRecords);
			LITTLE_BIG_SWAP(numRecords);
		}
	}
};
typedef struct bayo2EXPRecord_s
{
	short int			boneIndex;
	char				animationTrack;
	char				unknownA;
	short int			valueCount;
	short int			unknwonB;
	unsigned int		offset;
} bayo2EXPRecord_t;
template <bool big>
struct bayo2EXPRecord : public bayo2EXPRecord_s
{
	bayo2EXPRecord(bayo2EXPRecord_t *ptr) : bayo2EXPRecord_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(boneIndex);
			LITTLE_BIG_SWAP(valueCount);
			LITTLE_BIG_SWAP(unknwonB);
			LITTLE_BIG_SWAP(offset);
		}
	}
};

typedef struct bayoEXPRecord_s
{
	short int			unknownA;
	short int			boneIndex;
	char				animationTrack;
	char				entryType;
	char				unknownB;
	char				interpolationType;
	short int			numPoints;
	short int			unknownC;
	unsigned int		offset;
	unsigned int		offsetInterpolation;
} bayoEXPRecord_t;
template <bool big>
struct bayoEXPRecord : public bayoEXPRecord_s
{
	bayoEXPRecord(bayoEXPRecord_t * ptr) : bayoEXPRecord_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(unknownA);
			LITTLE_BIG_SWAP(boneIndex);
			LITTLE_BIG_SWAP(numPoints);
			LITTLE_BIG_SWAP(unknownC);
			LITTLE_BIG_SWAP(offset);
			LITTLE_BIG_SWAP(offsetInterpolation);
		}
	}
};
typedef struct bayoEXPInterpolationData4_s
{
	float p;
	float dp;
	float m0;
	float dm0;
	float m1;
	float dm1;
} bayoEXPInterpolationData4_t;
template <bool big>
struct bayoEXPInterpolationData4 : public bayoEXPInterpolationData4_s
{
	bayoEXPInterpolationData4(bayoEXPInterpolationData4_t * ptr) : bayoEXPInterpolationData4_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(p);
			LITTLE_BIG_SWAP(dp);
			LITTLE_BIG_SWAP(m0);
			LITTLE_BIG_SWAP(dm0);
			LITTLE_BIG_SWAP(m1);
			LITTLE_BIG_SWAP(dm1);
		}
	}
};
typedef struct bayoEXPInterpolationPoint4_s {
	float			v;
	unsigned short	dummy;
	unsigned short	cp;
	unsigned short	cm0;
	unsigned short	cm1;
} bayoEXPInterpolationPoint4_t;
template <bool big>
struct bayoEXPInterpolationPoint4 : public bayoEXPInterpolationPoint4_s
{
	bayoEXPInterpolationPoint4(bayoEXPInterpolationPoint4_t * ptr) : bayoEXPInterpolationPoint4_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(v);
			LITTLE_BIG_SWAP(dummy);
			LITTLE_BIG_SWAP(cp);
			LITTLE_BIG_SWAP(cm0);
			LITTLE_BIG_SWAP(cm1);
		}
	}
};
typedef struct bayo2EXPValue_s
{
	char			type;
	char			animationTrack;
	short int		boneIndex;
	float			value;
} bayo2EXPValue_t;
template <bool big>
struct bayo2EXPValue : public bayo2EXPValue_s
{
	bayo2EXPValue(bayo2EXPValue_t * ptr) : bayo2EXPValue_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(boneIndex);
			LITTLE_BIG_SWAP(value);
		}
	}
};
typedef struct bayo2EXPInterpolationData_s
{
	short int		numPoints;
	short int		unknownA;
	unsigned int	offset;
} bayo2EXPInterpolationData_t;
template <bool big>
struct bayo2EXPInterpolationData : public bayo2EXPInterpolationData_s
{
	bayo2EXPInterpolationData(bayo2EXPInterpolationData_t * ptr) : bayo2EXPInterpolationData_s(*ptr) {
		LITTLE_BIG_SWAP(numPoints);
		LITTLE_BIG_SWAP(unknownA);
		LITTLE_BIG_SWAP(offset);
	}
};
typedef struct bayo2EXPInterpolationPoint_s
{
	float v;
	float p;
	float m0;
	float m1;
} bayo2EXPInterpolationPoint_t;
template <bool big>
struct bayo2EXPInterpolationPoint : public bayo2EXPInterpolationPoint_s
{
	bayo2EXPInterpolationPoint(bayo2EXPInterpolationPoint_t *ptr) : bayo2EXPInterpolationPoint_s(*ptr) {
		LITTLE_BIG_SWAP(v);
		LITTLE_BIG_SWAP(p);
		LITTLE_BIG_SWAP(m0);
		LITTLE_BIG_SWAP(m1);
	}
};
typedef struct bayoEXPCoef_s
{
	unsigned int		flag;
	float				value;
} bayoEXPCoef_t;
typedef struct bayoEXPEntry1_s
{
	unsigned int		flag;
	short int			boneIndex;
	char				animationTrack;
	char				padding;
} bayoEXPEntry1_t;
template <bool big>
struct bayoEXPEntry1 : public bayoEXPEntry1_s
{
	bayoEXPEntry1(bayoEXPEntry1_t*ptr) : bayoEXPEntry1_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(flag);
			LITTLE_BIG_SWAP(boneIndex);
		}
	}
};
typedef struct bayoEXPEntry2_s
{
	unsigned int		flag;
	short int			boneIndex;
	char				animationTrack;
	char				padding;
	bayoEXPCoef_t		coefficient;
} bayoEXPEntry2_t;
template <bool big>
struct bayoEXPEntry2 : public bayoEXPEntry2_s
{
	bayoEXPEntry2(bayoEXPEntry2_t*ptr) : bayoEXPEntry2_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(flag);
			LITTLE_BIG_SWAP(boneIndex);
			LITTLE_BIG_SWAP(coefficient.flag);
			LITTLE_BIG_SWAP(coefficient.value);
		}
	}
};
typedef struct bayoEXPEntry3_s
{
	unsigned int		flag;
	short int			boneIndex;
	char				animationTrack;
	char				padding;
	bayoEXPCoef_t		coefficients[2];
} bayoEXPEntry3_t;
template <bool big>
struct bayoEXPEntry3 : public bayoEXPEntry3_s
{
	bayoEXPEntry3(bayoEXPEntry3_t*ptr) : bayoEXPEntry3_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(flag);
			LITTLE_BIG_SWAP(boneIndex);
			LITTLE_BIG_SWAP(coefficients[0].flag);
			LITTLE_BIG_SWAP(coefficients[0].value);
			LITTLE_BIG_SWAP(coefficients[1].flag);
			LITTLE_BIG_SWAP(coefficients[1].value);
		}
	}
};
typedef struct bayoMOTHdr_s
{
	BYTE				id[4];
	short int			unknownA;
	short int			frameCount;
	int					ofsMotion;
	int					numEntries;
} bayoMOTHdr_t;
template <bool big>
struct bayoMOTHdr : public bayoMOTHdr_s {
	bayoMOTHdr( bayoMOTHdr_t *ptr ): bayoMOTHdr_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(unknownA);
			LITTLE_BIG_SWAP(frameCount);
			LITTLE_BIG_SWAP(ofsMotion);
			LITTLE_BIG_SWAP(numEntries);
		}
	}
};
typedef struct bayo2MOTHdr_s
{
	BYTE				id[4];
	int					hash;
	short int			unknownA;
	short int			frameCount;
	int					ofsMotion;
	int					numEntries;
} bayo2MOTHdr_t;
template <bool big>
struct bayo2MOTHdr : public bayo2MOTHdr_s {
	bayo2MOTHdr( bayo2MOTHdr_t *ptr ): bayo2MOTHdr_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(hash);
			LITTLE_BIG_SWAP(unknownA);
			LITTLE_BIG_SWAP(frameCount);
			LITTLE_BIG_SWAP(ofsMotion);
			LITTLE_BIG_SWAP(numEntries);
		}
	}
};
typedef union bayoMotField_u
{
	float flt;
	int offset;
} bayoMotField_t;
typedef struct bayoMotItem_s
{
	short int			boneIndex;
	char				index;
	BYTE				flag;
	short int			elem_number;
	short int			unknown;
	bayoMotField_t		value;
} bayoMotItem_t;
template <bool big>
struct bayoMotItem : public bayoMotItem_s {
	bayoMotItem( bayoMotItem_t *ptr ): bayoMotItem_s(*ptr) {
		if(big) {
			LITTLE_BIG_SWAP(boneIndex);
			LITTLE_BIG_SWAP(index);
			LITTLE_BIG_SWAP(flag);
			LITTLE_BIG_SWAP(elem_number);
			LITTLE_BIG_SWAP(unknown);
			LITTLE_BIG_SWAP(value);
		}
	}
};
typedef struct bayo2InterpolKeyframe4_s {
	unsigned short int index;
	unsigned short int dummy;
	float p;
	float m0;
	float m1;
} bayo2InterpolKeyframe4_t;
template <bool big>
struct bayo2InterpolKeyframe4 : public bayo2InterpolKeyframe4_s {
	bayo2InterpolKeyframe4( bayo2InterpolKeyframe4_t *ptr ): bayo2InterpolKeyframe4_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(index);
			LITTLE_BIG_SWAP(dummy);
			LITTLE_BIG_SWAP(p);
			LITTLE_BIG_SWAP(m0);
			LITTLE_BIG_SWAP(m1);
		}
	}
};
typedef struct bayoInterpolHeader4_s {
	float values[6];
} bayoInterpolHeader4_t;
typedef struct bayoInterpolKeyframe4_s {
	unsigned short int index;
	unsigned short int coeffs[3];
} bayoInterpolKeyframe4_t;
template <bool big>
struct bayoInterpolKeyframe4 : public bayoInterpolKeyframe4_s {
	bayoInterpolKeyframe4( bayoInterpolKeyframe4_t *ptr): bayoInterpolKeyframe4_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(index);
			for(int i = 0; i < 3; i++) LITTLE_BIG_SWAP(coeffs[i]);
		}
	}
};
typedef short unsigned int pghalf;
typedef struct bayoInterpolHeader6_s {
	pghalf values[6];
} bayoInterpolHeader6_t;
typedef struct bayoInterpolKeyframe6_s {
	BYTE index;
	BYTE coeffs[3];
} bayoInterpolKeyframe6_t;
template <bool big>
struct bayoInterpolKeyframe6 : public bayoInterpolKeyframe6_s {
	bayoInterpolKeyframe6( bayoInterpolKeyframe6_t *ptr): bayoInterpolKeyframe6_s(*ptr) {
	}
};
typedef struct bayoInterpolHeader7_s {
	pghalf values[6];
} bayoInterpolHeader7_t;
typedef struct bayoInterpolKeyframe7_s {
	unsigned short int index;
	BYTE dummy;
	BYTE coeffs[3];
} bayoInterpolKeyframe7_t;
template <bool big>
struct bayoInterpolKeyframe7 : public bayoInterpolKeyframe7_s {
	bayoInterpolKeyframe7( bayoInterpolKeyframe7_t *ptr): bayoInterpolKeyframe7_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(index);
		}
	}
};
typedef struct bayoInterpolHeader8_s {
	pghalf values[6];
} bayoInterpolHeader8_t;
typedef struct bayoInterpolKeyframe8_s {
	unsigned short int index;
	BYTE coeffs[3];
} bayoInterpolKeyframe8_t;
template <bool big>
struct bayoInterpolKeyframe8 : public bayoInterpolKeyframe8_s {
	bayoInterpolKeyframe8( bayoInterpolKeyframe8_t *ptr): bayoInterpolKeyframe8_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(index);
		}
		else {
			LITTLE_BIG_SWAP(index);
		}
	}
};
typedef struct bayoVertexData_s {
	float position[3];			//00
	short uv[2];				//0C //half float really
	char normals[4];			//0F
	int unknwownA;				//14
	unsigned char boneIndex[4];	//18
	unsigned char boneWeight[4];//1C
} bayoVertexData_t;
typedef struct bayoMatType_s {
	bool known;
	short size;
	char texture_number;
	char lightmap_index;
	char normalmap_index;
	char texture2_index;
	char reflection_index;
} bayoMatType_t;

bayoMatType_t bayoMatTypes[256];

//thanks Phernost (stackoverflow)
class FloatDecompressor
{
	union Bits
	{
		float f;
		int si;
		unsigned int ui;
	};

	static int const significandFBits = 23;
	static int const exponentFBits = 8;
	static int const biasF = 127;
	static int const exponentF    = 0x7F800000;
	static int const significandF = 0x007fffff;
	static int const signF        = 0x80000000;

	int const significandHBits;
	int const exponentHBits;
	int const biasH;
    int exponentH;
	int significandH;
    static int const signH        = 0x8000;

	int shiftSign;
	int shiftBits;

public:

	FloatDecompressor(int eHBits, int sHBits, int bH): exponentHBits(eHBits), significandHBits(sHBits), biasH(bH) {
		int tmp = 0;
