#pragma once
typedef struct nierWMBHdr_s
{
	uint8_t  id[4];				// 0
	uint32_t version;			// 4
	int32_t  unknownA;			// 8
	uint16_t flags;				// C Seems related to vertex index size
	int16_t  referenceBone;		// E
	float    boundingBox[6];	//10
	uint32_t ofsBones;			//28
	int32_t  numBones;			//2C
	uint32_t ofsBoneIndexTT;	//30
	int32_t  sizeBoneIndexTT;	//34
	uint32_t ofsVertexGroups;	//38
	int32_t  numVertexGroups;	//3C
	uint32_t ofsBatches;		//40
	int32_t  numBatches;		//44
	uint32_t ofsLods;			//48
	int32_t  numLods;			//4C
	uint32_t ofsUnknownD;		//50
	int32_t  numUnknownE;		//54
	uint32_t ofsBoneMap;		//58
	int32_t  sizeBoneMap;		//5C
	uint32_t ofsBoneSets;		//60
	int32_t  numBoneSets;		//64
	uint32_t ofsMaterials;		//68
	int32_t  numMaterials;		//6C
	uint32_t ofsMeshes;			//70
	int32_t  numMeshes;			//74
	uint32_t ofsMeshMaterial;	//78
	int32_t  numMeshMaterial;	//7C
	uint32_t ofsUnknownF;		//80
	int32_t  numUnknownG;		//84
} nierWMBHdr_t;
template <bool big>
struct nierWMBHdr : public nierWMBHdr_s {
	nierWMBHdr(nierWMBHdr_t * ptr) : nierWMBHdr_s(*ptr) {
		if (big) {
			LITTLE_BIG_SWAP(*((int *)id));
			LITTLE_BIG_SWAP(version);
			LITTLE_BIG_SWAP(unknownA);
			LITTLE_BIG_SWAP(flags);
			LITTLE_BIG_SWAP(referenceBone);
			for (int i = 0; i < 6; i++) {
				LITTLE_BIG_SWAP(boundingBox[i]);
			}
			LITTLE_BIG_SWAP(ofsBones);
			LITTLE_BIG_SWAP(numBones);
			LITTLE_BIG_SWAP(ofsBoneIndexTT);
			LITTLE_BIG_SWAP(sizeBoneIndexTT);
			LITTLE_BIG_SWAP(ofsVertexGroups);
			LITTLE_BIG_SWAP(numVertexGroups);
			LITTLE_BIG_SWAP(ofsBatches);
			LITTLE_BIG_SWAP(numBatches);
			LITTLE_BIG_SWAP(ofsLods);
			LITTLE_BIG_SWAP(numLods);
			LITTLE_BIG_SWAP(ofsUnknownD);
			LITTLE_BIG_SWAP(numUnknownE);
			LITTLE_BIG_SWAP(ofsBoneMap);
			LITTLE_BIG_SWAP(sizeBoneMap);
			LITTLE_BIG_SWAP(ofsBoneSets);
			LITTLE_BIG_SWAP(numBoneSets);
			LITTLE_BIG_SWAP(ofsMaterials);
			LITTLE_BIG_SWAP(numMaterials);
